{"meta":{"title":"小贝的博客","subtitle":"像APP一样迭代自己","description":"AI学习之路","author":"小贝","url":"https://beishuai.github.io","root":"/"},"pages":[],"posts":[{"title":"3_笔记的焦虑","slug":"3_笔记的焦虑","date":"2019-04-24T14:03:47.000Z","updated":"2019-05-20T01:59:12.141Z","comments":true,"path":"2019/04/24/3_笔记的焦虑/","link":"","permalink":"https://beishuai.github.io/2019/04/24/3_笔记的焦虑/","excerpt":"","text":"笔记的焦虑这个笔记本在角落里躺了很久了，几乎要进垃圾箱，结束他的职业生涯了。那天收到光环老师邮来教科书之后，突然发现它又有用了，可以做草稿纸（看前几页都是胡乱写的），哈哈哈，然后，我就带着去图书馆了。 那天我还特别兴奋，还拍了照片发给老师。在图书馆奋斗了半天，结果只看了5页，好像是因为一个什么例题，卡住了半天，一盆凉水交了透心凉。 1数学，大家都知道，就像盖楼，它是一层层垒起来的，下面盖的不好，会直接影响上面，除非你把下面的再次补上。比如你不知道1+1=2，就没办法推导出1+2=3。 那天就十分焦虑就给老师诉苦，老师说你这进度太慢了，我突然意识到这个问题，就算了一下时间，第一阶段有几本书，平均每天看30页才行，第二天就快马加鞭了。 1以前我都是用云笔记的，这次本来也打算用云笔记的，但是一写笔记就发现，这数学公式在云笔记里太难搞了，而且时间紧迫，学MarkDown也来不及，于是这个草稿笔记本就顺利上位了，成了笔记本。 数学基础不好，时间又紧迫。怎么办？ 那就用最简单粗暴的方法，抄公式定理吧。我就开始了抄啊抄啊抄，把高数和线性代数里面的公式全抄了一遍，肯定会有同学问有什么用啊？的确没什么卵用，然后入学考试考的差。感觉就是考试的时候完全没有把公式用上，没有进入应用计算的状态，然后又特别焦虑。后来又偷偷的把题目照着书本上的答案，算了一遍，然而感觉还是基础差。怎么办？怎么办？怎么办？ 于是就上网各种搜索，怎么学习人工智能，怎么学好高数等等。唉，突然就发现这么一个视频，麻省理工Gilbert Strang的公开课，讲微积分的，看评价还不错，就看看吧。看了一节课，感觉挺好，不愧是数学家。他讲的课微积分一共17节，每节半小时，时间长度合适，难度合适。 1学习最好70%是已知知识，30%是新增的知识。 Gilbert Strang教授让我重新认识了数学，有种被重塑的感觉，喜欢上了数学。真的假的？自我暗示？当然每个人观感和理解是不一样的，尽自己最大努力理解就好。后来还发现，他还讲了线性代数，简直爱死这个教授了。 其实这时候早就进入第二阶段了，应该看凸优化，概率论，统计学习方法了。但是基础差，没办法，每天加班看一节吧。 第一次看凸优化时，又焦虑了。什么玩意，没学过，完全看不懂啊。怎么办？怎么办？怎么办？又开始网上各种搜索，唉，发现一个视频：半小时掌握凸优化。看看吧，有点意思，起码他讲的能听懂了，听了3遍，后来感觉还是不行啊，和老师发的书相比，半小时内容太少了。继续在网上各种搜，唉，又发现一个视频，是一个讲人工智能的视频，中间有两节课讲到凸优化，一共5个小时，感觉还不错哦，就跟着这个视频学起来啦。就这样，一边看凸优化，一边看微积分，一边看python视频。 1为了加快进度，我在网上找到一个播放器potplayer，遇到熟悉的地方可以倍速播放，并且potplayer可以1.1、1.2、1.3、1.4这样的倍数播放，适应起来很容易。 搞完凸优化，再看概率论，和前面一样，完全看不懂，在去网上找视频，找到一个新东方老师讲的，他是给考研的学生讲的。概率论基础课程，唉，一共10节，每节课半小时，简单易懂，时间长短也合适，毕竟时间紧迫。这个老师有个要求，让学生记笔记，这个笔记本又有作用了，拿出来记概率论笔记。这时候微积分还没看完，我想，为什么学微积分的时候不记一下笔记呢？于是微积分的笔记也写上了。 再后来，线性代数的笔记写上了。 再后来，统计学习方法，这时找到了视频，但是太长了，都是大学一学期的视频录制，时间紧迫没法看了。就看书吧，算法看不懂，还是采用本办法记笔记吧，因为大多是文字，就用xmind思维导图记录了。（如下图，内容太多只展开了一章，以后再逐步完善） 再后来看python课程，因为之前每天都在看python视频，再加上我本来是做编程的，很容易理解，就跟着视频边学边写代码就可以了。 紧迫焦虑的预习过程就这样过去了，伴随着焦虑诞生了有道笔记、纸质笔记、Xmind笔记等一系列笔记，此之为“笔记的焦虑”。 下面开始进入真正的学习阶段了。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://beishuai.github.io/tags/随笔/"}]},{"title":"2_如何学习AI？","slug":"2_如何学习AI？","date":"2019-04-17T15:01:08.000Z","updated":"2019-04-18T01:24:35.229Z","comments":true,"path":"2019/04/17/2_如何学习AI？/","link":"","permalink":"https://beishuai.github.io/2019/04/17/2_如何学习AI？/","excerpt":"","text":"如何学习AI？在决定学习AI后，我开始不断的思考如何学习AI，并努力寻找答案，试图找到最适合我的方式。首先，是上网搜索一些资料，寻找大致的思路。其次，到处找亲朋好友，还有以前的领导和同事等交谈，试图从他们那里获得有价值的信息。总之，就是通过各种各样的途径获取有价值的信息，并且试图通过这些信息，找到一条最佳的路。 总结各种信息，学习AI要有数学基础包括高等数学，线性代数、概率论和数理统计等，当然只是用到其中的一部分知识，学有用的即可。要学习一门编程语言，通常是从python入手，简单易学且有很好的工具库支撑。有了这些基础，可以开始学习简单的机器学习或深度学习知识，真正进入AI学习阶段。阶段1：了解别人写好的算法，能够使用算法实现一些小功能。阶段2：能够进行模型的调优，解决一些问题。阶段3：能实现算法，解决复杂问题。阶段4：完成算法设计以及优化。 了解了AI相关的信息后，回到最初那个问题，如何学习AI？AI是一个系统的知识体系，自学是不太现实的，而且很容易跑偏浪费大量的时间，报学习班是个不错的选择。总结一下，报培训班有这么几个好处。一是能够学习一套相对完善的知识体系；二是能够认识一帮同学，这些人会是以后在AI圈子的重要支撑；三是学习要花钱自己会学习的更认真，并且有同学老师的监督和陪伴会有完全不一样的学习效果。在一次交流中，有个亲戚提到了有人在光环国际学过大数据还不错，这勾起了我长久的记忆，我2013年曾经在光环国际学过PMP项目管理，是个靠谱的培训公司，于是我找到了当时认识的在光环上班的朋友了解情况（未曾想她已经换了公司）。我俩一起吃了顿饭，在交谈之后，我当即决定报了名。 时间紧迫，迈出第一步很关键。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://beishuai.github.io/tags/随笔/"}]},{"title":"1_为什么学AI？","slug":"1_为什么学AI？","date":"2019-04-12T11:01:08.000Z","updated":"2019-04-18T02:09:12.795Z","comments":true,"path":"2019/04/12/1_为什么学AI？/","link":"","permalink":"https://beishuai.github.io/2019/04/12/1_为什么学AI？/","excerpt":"","text":"为什么学AI？看完电影《绿皮书》以后，一个人走在大街上……感慨道：每个遇到的人，都会或多或少地对你产生一定的影响，使你的人生发生一些改变，我学习AI就源自这些改变。 首先，经投资圈朋友的推荐下载了得到，在上面学习了很多课程，对自己人生的改变和启发都很大，最重要的是意识到要成为一个终身学习的人，想APP一样迭代自己。其次，因为公司的事情，家庭的事情，自己人生的追求等等，各种事情综合观感，我自己的人生走到了某个需要改变的阶段。再次，吴军老师的得到课程《谷歌方法论》，里面讲了很多和计算机有关的课程，也有对人工智能的观点和展望，这些最终使我下定决心学习人工智能。 既然知道人工智能是大趋势，那么为什么不赶上这趟车呢，去体验一下不一样的风景。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://beishuai.github.io/tags/随笔/"}]},{"title":"学习就像一场旅行","slug":"test","date":"2019-04-09T05:44:39.000Z","updated":"2019-04-18T01:24:34.185Z","comments":true,"path":"2019/04/09/test/","link":"","permalink":"https://beishuai.github.io/2019/04/09/test/","excerpt":"","text":"学习就像一场旅行，享受在路上的过程。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://beishuai.github.io/tags/随笔/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-04-08T05:44:39.000Z","updated":"2019-05-20T04:25:49.286Z","comments":true,"path":"2019/04/08/hello-world/","link":"","permalink":"https://beishuai.github.io/2019/04/08/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}